INSERT INTO customers (last_name, first_name, patronymic, phone) VALUES
('Иванов', 'Иван', 'Иванович', '+79991112233'),
('Петров', 'Пётр', 'Сергеевич', '+79995554466'),
('Сидорова', 'Мария', 'Александровна', '+79997778899'),
('Кузнецов', 'Алексей', 'Алексеевич', '+79990001122'),
('Смирнова', 'Ольга', 'Владимировна', '+79992223344');

INSERT INTO employees (last_name, first_name, patronymic, position) VALUES
('Сергеев', 'Николай', 'Павлович', 'Бариста'),
('Васильева', 'Анна', 'Игоревна', 'Бариста'),
('Фёдоров', 'Дмитрий', 'Николаевич', 'Администратор'),
('Крылова', 'Елена', 'Владимировна', 'Кассир'),
('Громов', 'Александр', 'Викторович', 'Менеджер');

INSERT INTO products (title, category, price) VALUES
('Эспрессо', 'Кофе', 150.00),
('Американо', 'Кофе', 170.00),
('Капучино', 'Кофе', 220.00),
('Латте', 'Кофе', 230.00),
('Чай зелёный', 'Чай', 120.00),
('Чай чёрный', 'Чай', 120.00),
('Чизкейк', 'Десерт', 250.00),
('Маффин шоколадный', 'Десерт', 180.00);

INSERT INTO orders (customer_id, employee_id, total)
VALUES (1, 2, 370.00);

INSERT INTO order_items (order_id, product_id, quantity) VALUES
(1, 3, 1),
(1, 8, 1);
